package HomeWork.Maths;

public class Ex_1 {
    /*
    Напишите класс, который генерирует и выводит на экран случайное
    целое чисел из диапазона положительных двузначных чисел.
     */

    public static void main(String[] args) {
        int i = (int) (100 * Math.random());

        System.out.println(i);
    }
}
